Revit 2027 API
SpatialElement.Perimeter Property
The perimeter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Perimeter { get; }
Public ReadOnly Property Perimeter As Double
	Get
public:
property double Perimeter {
	double get ();
}
member Perimeter : float with get
Property Value
Double
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace